#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/aws-terraform-cloud-resume-iac-challenge/runs/run-wBshf5kMEfsoqHr2

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
module.lambda.data.archive_file.lambda_zip: Refreshing...
module.lambda.data.archive_file.lambda_zip: Refresh complete after 0s [id=7fddff281ed36dc20d2cf941c4eb3e95bbb15066]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.lambda_log_group will be created
  + resource "aws_cloudwatch_log_group" "lambda_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/resume_counter"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
    }

  # module.api.aws_apigatewayv2_api.resume_api_gw will be created
  + resource "aws_apigatewayv2_api" "resume_api_gw" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "resume-api-gw"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }

      + cors_configuration {
          + allow_headers = [
              + "content-type",
            ]
          + allow_methods = [
              + "GET",
              + "OPTIONS",
              + "POST",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.api.aws_apigatewayv2_integration.lambda_integration will be created
  + resource "aws_apigatewayv2_integration" "lambda_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api.aws_apigatewayv2_route.api_route will be created
  + resource "aws_apigatewayv2_route" "api_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "GET /getcount"
      + target             = (known after apply)
    }

  # module.api.aws_apigatewayv2_stage.api_stage will be created
  + resource "aws_apigatewayv2_stage" "api_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
    }

  # module.api.aws_lambda_permission.api_gw_lambda will be created
  + resource "aws_lambda_permission" "api_gw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "resume_counter"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.cdn.aws_cloudfront_distribution.s3_distribution will be created
  + resource "aws_cloudfront_distribution" "s3_distribution" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "S3Origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "S3Origin"
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # module.cdn.aws_cloudfront_origin_access_control.resume_oac will be created
  + resource "aws_cloudfront_origin_access_control" "resume_oac" {
      + arn                               = (known after apply)
      + description                       = "Managed by Terraform"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "resume-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.database.aws_dynamodb_table.visitor_count will be created
  + resource "aws_dynamodb_table" "visitor_count" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "VisitorCount"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.database.aws_iam_role_policy.lambda_db_policy will be created
  + resource "aws_iam_role_policy" "lambda_db_policy" {
      + id          = (known after apply)
      + name        = "LambdaDynamoDBAccess"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.lambda.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "resume_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambda.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "resume_lambda_role"
    }

  # module.lambda.aws_lambda_function.resume_api will be created
  + resource "aws_lambda_function" "resume_api" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/lambda/func.zip"
      + function_name                  = "resume_counter"
      + handler                        = "func.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.13"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "CxCh4vjSBC/uDGNdoRyCRR6ObErVnepFI/UrfkRXM4w="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.storage.aws_s3_bucket.resume_bucket will be created
  + resource "aws_s3_bucket" "resume_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "ShenLoong"
          + "Project"     = "CloudResumeChallenge"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.storage.aws_s3_bucket_lifecycle_configuration.resume_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "resume_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "archive-old-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = false
            }

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 7
            }
        }
    }

  # module.storage.aws_s3_bucket_policy.allow_access_from_cloudfront will be created
  + resource "aws_s3_bucket_policy" "allow_access_from_cloudfront" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.storage.aws_s3_bucket_public_access_block.resume_block will be created
  + resource "aws_s3_bucket_public_access_block" "resume_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.storage.aws_s3_bucket_server_side_encryption_configuration.resume_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "resume_encryption" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.storage.aws_s3_bucket_versioning.resume_versioning will be created
  + resource "aws_s3_bucket_versioning" "resume_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.storage.random_string.bucket_suffix will be created
  + resource "random_string" "bucket_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_url            = (known after apply)
  + aws_region         = "ap-southeast-1"
  + cloudfront_dist_id = (known after apply)
  + lambda_arn         = (known after apply)
  + website_bucket_id  = (known after apply)
  + website_url        = (known after apply)

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 9 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>